// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com
#include "aaSystem.h"
#include "aaContainer.h"

using namespace ecs;
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
///
///
/// Constructor
///
///
///-------------------------------------------------------------------------
ISystem::ISystem()
{


}
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
///
///
/// Destructor
///
///
///-------------------------------------------------------------------------
ISystem::~ISystem()
{
    unregisterContainer();
}
///-------------------------------------------------------------------------






 ///------------------------------------------------------------------------
///
///
///
/// регистрация контейнера
///
///
///-------------------------------------------------------------------------
void ISystem::registerContainer(AContainer *pContainer)
{
    if (pContainer == container || pContainer == nullptr)
    {
        return;
    }

    if (container)
    {
        unregisterContainer();
    }
    container = pContainer;
    container->registerSystem(this);
}
///-------------------------------------------------------------------------






 ///------------------------------------------------------------------------
///
///
///
/// снятие регистрации с контейнера
///
///
///-------------------------------------------------------------------------
void ISystem::unregisterContainer()
{
    if (container)
    {
        auto save = container;
        container = nullptr;
        save->unregisterSystem(this);
    }
}
///-------------------------------------------------------------------------






 ///------------------------------------------------------------------------
///
///
///
/// система поменяла свои действия
///
///
///-------------------------------------------------------------------------
void ISystem ::changeComponents()
{
    changed = true;
}
///-------------------------------------------------------------------------









 ///------------------------------------------------------------------------
///
///
///
/// обновление клнкретного контейнера
///
///
///-------------------------------------------------------------------------
/*
template <class T>
void ecs::ASystem<T> :: refreshComponents()
{
    components.clear();


}*/