#pragma once
#include <memory>

#include "ecs/aaSystem.h"
#include "Components/Graphics/Component_Effects.h"


namespace game
{
    ///-------------------------------------------------------------------------
    ///-------------------------------------------------------------------------






     ///------------------------------------------------------------------------
    ///
    ///
    ///
    /// Система обновления для эффектов
    ///
    ///
    ///-------------------------------------------------------------------------
    class ASystemEffects
        :
        public ecs::ASystem<AComponentEffects>
    {
    public:


        ASystemEffects();
        ~ASystemEffects() override;



        ///-------------------------------------------------------------------------

    public:


        void update(const float timeSpan);


        ///-------------------------------------------------------------------------

    private:

    


    };
    ///-------------------------------------------------------------------------




}
