#pragma once
#include <memory>
#include <string>



#include "ParserLevel.h"

namespace parser
{
    ///-------------------------------------------------------------------------
    ///-------------------------------------------------------------------------





     ///------------------------------------------------------------------------
    ///
    /// <summary>
    /// Фабрика создания парсера
    /// </summary>
    ///
    ///
    ///-------------------------------------------------------------------------
    class AFactory
    {

    public:

        AFactory();
        virtual ~AFactory();

   

        PParserLevel create(const std::string &fileName); //создание парсера


    private:


    };
    ///-------------------------------------------------------------------------




}
