// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com
#include "Component_GeometryData.h"





///-------------------------------------------------------------------------
using namespace game;
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
///
///
/// Constructor
///
///
///-------------------------------------------------------------------------
AComponentGeometryData::AComponentGeometryData(const FPoint &position, const FPoint &size, const float angle)
    :
        mPosition(position),
        mSize(size),
        mAngle(angle)
{

}
///-------------------------------------------------------------------------








 ///------------------------------------------------------------------------
///
/// <summary>
/// позиция
/// </summary>
///
///-------------------------------------------------------------------------
FPoint AComponentGeometryData :: position() const
{
    return mPosition;
}
///-------------------------------------------------------------------------






 ///------------------------------------------------------------------------
///
/// <summary>
/// поворот 
/// </summary>
///
///-------------------------------------------------------------------------
float AComponentGeometryData ::  angle() const
{
    return mAngle;
}
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
/// <summary>
/// установка текущей позиции
/// </summary>
///
///-------------------------------------------------------------------------
void AComponentGeometryData::setPosition(const FPoint &pos)
{
    mPosition = pos;
}
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
/// <summary>
/// установка угла наклона
/// </summary>
///
///-------------------------------------------------------------------------
void AComponentGeometryData::setAngle(const float degrees)
{
    mAngle = degrees;
}
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
/// <summary>
/// ограничиваюшая рамка элемента
/// </summary>
///
///-------------------------------------------------------------------------
FPoint AComponentGeometryData ::boundingSize() const
{
    return mSize;
}
///-------------------------------------------------------------------------



