#pragma once
#include <memory>
#include <string>

#include "Render.h"
#include "ecs/aaComponent.h"

namespace game
{
    ///-------------------------------------------------------------------------
    ///-------------------------------------------------------------------------





     ///------------------------------------------------------------------------
    ///
    /// <summary>
    /// Компонент который может отрисовыватся на экране
    /// отладочную информацию
    /// </summary>
    ///
    ///
    ///-------------------------------------------------------------------------
    class AComponentDebug
        :
        public ecs::AComponent
    {
        using super = ecs::AComponent;

    public:


        virtual void draw(dm::ARender &render) = 0; //отрисовка 





    };
    ///-------------------------------------------------------------------------



    ///-------------------------------------------------------------------------
    using PComponentDebug = std::shared_ptr< AComponentDebug >;
    ///-------------------------------------------------------------------------



}
