// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com
#include "Component_Bonus.h"
#include "ecs/aaContainer.h"


///-------------------------------------------------------------------------
using namespace game;
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
///
///
/// Constructor
///
///
///-------------------------------------------------------------------------
AComponentBonus::AComponentBonus()
{

}
///-------------------------------------------------------------------------








 ///------------------------------------------------------------------------
///
/// <summary>
/// destructor
/// </summary>
///
///-------------------------------------------------------------------------
AComponentBonus::~AComponentBonus()
{

}
///-------------------------------------------------------------------------



 ///------------------------------------------------------------------------
///
/// <summary>
/// использовать бонус
/// </summary>
///
///-------------------------------------------------------------------------
void AComponentBonus::use()
{
    if (!mUsing)
    {
        mUsing = true; 
        onUse();
    }

    auto container = getContainer();
    auto actor = getActor();
    if (container && actor)
    {
        container->remove(actor);
    }
}
///-------------------------------------------------------------------------



