// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com
#include "ParserFactory.h"
#include "ParserLevel_TextFile.h"



///-------------------------------------------------------------------------
using namespace parser;
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
///
///
/// Constructor
///
///
///-------------------------------------------------------------------------
AFactory::AFactory()
{


}
///-------------------------------------------------------------------------







 ///------------------------------------------------------------------------
///
///
///
/// Destructor
///
///
///-------------------------------------------------------------------------
AFactory::~AFactory()
{


}
///-------------------------------------------------------------------------





 ///------------------------------------------------------------------------
///
/// <summary>
/// создание парсера
/// </summary>
///
///-------------------------------------------------------------------------
PParserLevel AFactory:: create(const std::string &fileName)
{
   
    if (fileName.rfind(".txt") != std::string::npos)
    {
        //если это обычные текстовый файл
        return std::make_shared<ATextFile>(fileName);
    }

    //здесь возможно бинарный, 
    //либо json файл.

    return PParserLevel();
}
///-------------------------------------------------------------------------









